Revit 2027 API
BuiltInFailures.DimensionFailures.WrongConstraintInTrussSketch Property
 Structural Truss sketch can't be constrained to its members.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WrongConstraintInTrussSketch { get; }
Public Shared ReadOnly Property WrongConstraintInTrussSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WrongConstraintInTrussSketch {
	FailureDefinitionId^ get ();
}
static member WrongConstraintInTrussSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace